source variables.scr
read_verilog -netlist ../netlist/IIR_filter_optimized.v
read_saif -input ../saif/iir_filter_optimized.saif -instance IIR_tb/UUT -unit ns -scale 1
create_clock -name MY_CLK CLK
report_power > $out_dir/report_power_final_optimized.txt
